---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PropertySegmentNS
source: html/1b5a0a22-2613-64de-ce7b-b8b9dcff4dd2.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PropertySegmentNS Property

"N/S"

## Syntax (C#)
```csharp
public static ForgeTypeId PropertySegmentNS { get; }
```